Ac6Embedded/svd-microchip/PIC32CZ_CA70/PIC32CZ5125CA70100.svd
            <register>
               <name>ETRG1</name>
               <description>PWM External Trigger Register (trg_num = 1)</description>
               <addressOffset>0x42C</addressOffset>
               <fields>
                  <field>
                     <name>MAXCNT</name>
                     <description>Maximum Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>TRGMODE</name>
                     <description>External Trigger Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGMODESelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>External trigger is not enabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>External PWM Reset Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE2</name>
                           <description>External PWM Start Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE3</name>
                           <description>Cycle-by-cycle Duty Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGEDGE</name>
                     <description>Edge Selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGEDGESelect</name>
                        <enumeratedValue>
                           <name>FALLING_ZERO</name>
                           <description>TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_ONE</name>
                           <description>TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGFILT</name>
                     <description>Filtered input</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGSRC</name>
                     <description>Trigger Source</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFEN</name>
                     <description>Recoverable Fault Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LEBR1</name>
               <description>PWM Leading-Edge Blanking Register (trg_num = 1)</description>
               <addressOffset>0x430</addressOffset>
               <fields>
                  <field>
                     <name>LEBDELAY</name>
                     <description>Leading-Edge Blanking Delay for TRGINx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PWMLFEN</name>
                     <description>PWML Falling Edge Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMLREN</name>
                     <description>PWML Rising Edge Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMHFEN</name>
                     <description>PWMH Falling Edge Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMHREN</name>
                     <description>PWMH Rising Edge Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMUPD2</name>
               <description>PWM Channel Mode Update Register (ch_num = 2)</description>
               <addressOffset>0x440</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CPOLUP</name>
                     <description>Channel Polarity Update</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOLINVUP</name>
                     <description>Channel Polarity Inversion Update</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ETRG2</name>
               <description>PWM External Trigger Register (trg_num = 2)</description>
               <addressOffset>0x44C</addressOffset>
               <fields>
                  <field>
                     <name>MAXCNT</name>
                     <description>Maximum Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>TRGMODE</name>
                     <description>External Trigger Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGMODESelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>External trigger is not enabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>External PWM Reset Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE2</name>
                           <description>External PWM Start Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE3</name>
                           <description>Cycle-by-cycle Duty Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGEDGE</name>
                     <description>Edge Selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGEDGESelect</name>
                        <enumeratedValue>
                           <name>FALLING_ZERO</name>
                           <description>TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_ONE</name>
                           <description>TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGFILT</name>
                     <description>Filtered input</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGSRC</name>
                     <description>Trigger Source</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFEN</name>
                     <description>Recoverable Fault Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>LEBR2</name>
               <description>PWM Leading-Edge Blanking Register (trg_num = 2)</description>
               <addressOffset>0x450</addressOffset>
               <fields>
                  <field>
                     <name>LEBDELAY</name>
                     <description>Leading-Edge Blanking Delay for TRGINx</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>PWMLFEN</name>
                     <description>PWML Falling Edge Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMLREN</name>
                     <description>PWML Rising Edge Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMHFEN</name>
                     <description>PWMH Falling Edge Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PWMHREN</name>
                     <description>PWMH Rising Edge Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMUPD3</name>
               <description>PWM Channel Mode Update Register (ch_num = 3)</description>
               <addressOffset>0x460</addressOffset>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CPOLUP</name>
                     <description>Channel Polarity Update</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOLINVUP</name>
                     <description>Channel Polarity Inversion Update</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
